export default {
    ip: {
        reg: /^(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])$/,
        message: '请输入正确的ip地址'
    },
    name: {
        reg: /^[\w\W]{1,30}$/,
        message: '请输入长度为1-30位'
    },
    port: {
        reg: /^([0-9]|[1-9]\d|[1-9]\d{2}|[1-9]\d{3}|[1-5]\d{4}|6[0-4]\d{3}|65[0-4]\d{2}|655[0-2]\d|6553[0-5])$/,
        message: '请输入正确的端口号'
    },
    path: {
        reg: /^[^\\]+$/,
        message: '请输入正确的路径'
    },
    version: {
        reg: /^([1-9][0-9]*)$/,
        message: '版本号必须为纯数字'
    },
    int: {
        reg: /^[\d]+$/,
        message: '只能输入数字'
    },
    number: {
        reg: /^\d+(\.\d+)?$/,
        message: '只能输入数字'
    },
    configValue: {
        reg: /^(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])$/
    },
    logName: {
        reg: /^[A-Za-z0-9_]{6,30}$/,
        message: '请输入6-30位的字母、数字、下划线的组合'
    },
    password: {
        reg: /^[\w\W]{6,18}$/,
        message: '请输入6-18位的字母、数字、字符的组合'
    },
    userName: {
        reg: /^[\u4E00-\u9FA5A-Za-z0-9]+$/,
        message: '请输入2-18位的字母、数字、汉字的组合'
    },
    deviceName: {
        reg: /^[\u4E00-\u9FA5A-Za-z0-9-_]+$/,
        message: '请输入字母数字下划线的组合'
    },
    phoneNumber: {
        reg: /^1[0-9]{10}$/,
        message: '请输入合法的手机号码'
    },
    email: {
        reg: /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
        message: '请输入合法的邮箱地址'
    },
}
